Travel/app/views/static_pages/home.html.erb

                <h1>Top Places</h1><br/>
                <% Place.order(:avarage => 'desc').limit(4).each do |place| %>
---
SELECT  "places".* FROM "places" ORDER BY "avarage" DESC LIMIT ?  [["LIMIT", 4]]

            </div>
            <% User.order(:num_dislikes,num_likes: :desc).limit(4).each do |user| %>
---
SELECT  "users".* FROM "users" ORDER BY "users"."num_dislikes" ASC, "users"."num_likes" DESC LIMIT ?  [["LIMIT", 4]]