Travel/app/controllers/dislikes_controller.rb

    def create
        authorize! :update, @review, :message => "BEWARE: You are not authorized to update a review"
        @review.dislikes.create(user_id: current_user.id)
        @user = @review.user
        @user.num_dislikes += 1
        @like = @review.likes.where(["user_id = ?", current_user.id]).first
        if !@like.nil?
            @review.likes.destroy(@like.id)
            @user.num_likes -= 1
        end
        @user.save!
---
INSERT INTO "dislikes" ("review_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["review_id", 2], ["user_id", 1], ["created_at", "2019-06-28 10:35:08.832751"], ["updated_at", "2019-06-28 10:35:08.832751"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "likes".* FROM "likes" WHERE "likes"."review_id" = ? AND (user_id = 1) ORDER BY "likes"."id" ASC LIMIT ?  [["review_id", 2], ["LIMIT", 1]]
UPDATE "users" SET "num_dislikes" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["num_dislikes", 1], ["updated_at", "2019-06-28 10:35:08.844610"], ["id", 1]]

    def find_review
        @review = Review.find(params[:review_id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]