Travel/app/controllers/likes_controller.rb

    def create
        authorize! :update, @review, :message => "BEWARE: You are not authorized to update a review"
        @review.likes.create(user_id: current_user.id)
        @user = @review.user
        @user.num_likes += 1
        @dislike = @review.dislikes.where(["user_id = ?", current_user.id]).first
        if !@dislike.nil?
            @review.dislikes.destroy(@dislike.id)
            @user.num_dislikes -= 1
        end
        @user.save!
---
INSERT INTO "likes" ("review_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["review_id", 1], ["user_id", 1], ["created_at", "2019-06-28 10:35:06.745785"], ["updated_at", "2019-06-28 10:35:06.745785"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "dislikes".* FROM "dislikes" WHERE "dislikes"."review_id" = ? AND (user_id = 1) ORDER BY "dislikes"."id" ASC LIMIT ?  [["review_id", 1], ["LIMIT", 1]]
UPDATE "users" SET "num_likes" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["num_likes", 1], ["updated_at", "2019-06-28 10:35:06.757909"], ["id", 1]]

    def destroy
        authorize! :update, @review, :message => "BEWARE: You are not authorized to update a review"
        if !(already_liked?)
            flash[:notice] = "Cannot unlike"
        else
            @like.destroy
            @user = @review.user
            @user.num_likes -= 1
            @user.save!
---
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]
UPDATE "users" SET "num_likes" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["num_likes", 0], ["updated_at", "2019-06-28 13:14:20.972703"], ["id", 1]]

    def already_liked?
        Like.where(user_id: current_user.id, review_id: params[:review_id]).exists?
---
SELECT  1 AS one FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."review_id" = ? LIMIT ?  [["user_id", 1], ["review_id", 1], ["LIMIT", 1]]

    def find_review
        @review = Review.find(params[:review_id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def find_like
        @like = @review.likes.find(params[:id])
---
SELECT  "likes".* FROM "likes" WHERE "likes"."review_id" = ? AND "likes"."id" = ? LIMIT ?  [["review_id", 1], ["id", 1], ["LIMIT", 1]]