Travel/app/controllers/places_controller.rb

SELECT "places".* FROM "places"
---
    def index
        if current_user.is? :admin
            @places = Place.all

SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        begin
            id = params[:id] # retrieve place ID from URI route
            @place = Place.find(id)

INSERT INTO "places" ("name", "street", "address", "city", "telephone_number", "opening_time", "closing_time", "description", "notices", "created_at", "updated_at", "user_id", "avarage", "icon") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @owner = current_user
        @place = @owner.property.build(params[:place].permit(:name, :street, :address, :city, :telephone_number, :opening_time, :closing_time, :description, :notices, :icon))
        authorize! :create, @place, :message => "BEWARE: You are not authorized to create a new place."
        @place.save!

SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @place = Place.find params[:id]

SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "places" SET "icon" = ?, "updated_at" = ? WHERE "places"."id" = ?  [["icon", "https://i.kinja-img.com/gawker-media/image/upload/s--xL10Cnzo--/c_fit,f_auto,fl_progressive,q_80,w_320/ld7ely1swz0uk3drhwlj.jpg"], ["updated_at", "2019-06-28 10:16:48.963411"], ["id", 1]]
---
    def update
        @place = Place.find params[:id]
        authorize! :update, @place, :message => "BEWARE: You are not authorized to update a place."
        if current_user != @place.user
            flash[:warning] = "You are not authorized to update this place"
            redirect_to place_path(@place)
        end
        @place.update_attributes!(params[:place].permit(:name, :street, :address, :city, :telephone_number, :opening_time, :closing_time, :description, :notices, :icon))

SELECT "places".* FROM "places" WHERE "places"."name" = ?  [["name", "sadas"]]
---
    def find
        @places = Place.where(name: params[:name])