Travel/app/controllers/reviews_controller.rb

SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "reviews" ("rating", "comments", "user_id", "place_id") VALUES (?, ?, ?, ?)  [["rating", 5], ["comments", "asdasd"], ["user_id", 1], ["place_id", 2]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."place_id" = ?  [["place_id", 2]]
UPDATE "places" SET "avarage" = ?, "updated_at" = ? WHERE "places"."id" = ?  [["avarage", 5.0], ["updated_at", "2019-06-28 10:34:51.112965"], ["id", 2]]
---
    def create
        id_place = params[:place_id]
		@place = Place.find(id_place)
        @user = current_user
        pre_average = @place.average
        @review = @place.reviews.build(params[:review].permit(:rating, :comments))
        authorize! :create, @review, :message => "BEWARE: You are not authorized to create a new review."
        @user.reviews << @review
        @review.save!
        @place.average = ((pre_average * (@place.reviews.count - 1)) + @review.rating) / @place.reviews.count
        @place.save!

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 1]]
---
    def destroy
        id = params[:id]
        @review = Review.find(id)
        if(current_user == @review.user || current_user.is?(:moderator) || current_user.is?(:admin))
            id_place = params[:place_id]
            @place = Place.find(id_place)
            authorize! :destroy, @review, :message => "BEWARE: You are not authorized to delete a review."
            if @place.reviews.count == 1
                @place.average = 0
            else
                @place.average = (@place.average * @place.reviews.count - @review.rating) / (@place.reviews.count - 1)
            end
            @place.save!
            @review.destroy