Travel/app/controllers/users_controller.rb

    def index
        if current_user.is? :admin
            @users = User.all
---
SELECT "users".* FROM "users"

    def show
        begin
            id = params[:id] #retrieve user ID from URI route
            @user = User.find(id) # look up id bi unique ID
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def favorite
        @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def reviews
        @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]