Travel/app/views/places/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."place_id" = ?  [["place_id", 2]]
SELECT  1 AS one FROM "reviews" WHERE "reviews"."place_id" = ? LIMIT ?  [["place_id", 1], ["LIMIT", 1]]
---
<h3>Reviews:</h3>
<% if @place.reviews.empty? %>

SELECT "dislikes".* FROM "dislikes" WHERE "dislikes"."review_id" = ?  [["review_id", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."review_id" = ?  [["review_id", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."place_id" = ?  [["place_id", 2]]
SELECT COUNT(*) FROM "dislikes" WHERE "dislikes"."review_id" = ?  [["review_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    <% if can? :read, Review %>
    <% reviews = @place.reviews.sort_by { |r| r.dislikes.count - r.likes.count } %>
    <%  reviews.each do |r| %>
      <% u = User.find_by_id(r.user_id) %>