Travel/app/views/users/reviews.html.erb

SELECT "likes".* FROM "likes" WHERE "likes"."review_id" = ?  [["review_id", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."review_id" = ?  [["review_id", 1]]
SELECT "dislikes".* FROM "dislikes" WHERE "dislikes"."review_id" = ?  [["review_id", 1]]
SELECT COUNT(*) FROM "dislikes" WHERE "dislikes"."review_id" = ?  [["review_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    <% @reviews.each do |r| %>
        <% likes = r.likes.count %>
        <% dislikes = r.dislikes.count %>
        <% pre_like = r.likes.find { |like| like.user_id == @user.id} %>
        <% pre_dislike = r.dislikes.find { |dislike| dislike.user_id == @user.id} %>
        <b> <%= r.rating %> </b> (<i><%= @user.email %></i>) <%= r.comments %> - <%= likes %> <%= (r.likes.count) == 1 ? 'Like' : 'Likes' %>

SELECT COUNT(*) FROM "dislikes" WHERE "dislikes"."review_id" = ?  [["review_id", 1]]
SELECT "dislikes".* FROM "dislikes" WHERE "dislikes"."review_id" = ?  [["review_id", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."review_id" = ?  [["review_id", 1]]
---
            <%= link_to 'Like', place_review_likes_path(r.place, r), :method => :post %>
        <% end %> <%= dislikes %> <%= (r.dislikes.count) == 1 ? 'Dislike' : 'Dislikes' %>