Travel/app/models/user.rb

INSERT INTO "users" ("name", "provider", "uid", "surname", "created_at", "updated_at", "email", "encrypted_password", "roles_mask") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ? ORDER BY "users"."id" ASC LIMIT ?  [["provider", "facebook"], ["uid", "107733850508887"], ["LIMIT", 1]]
---
  def self.from_omniauth(auth)
    where(provider: auth.provider, uid: auth.uid).first_or_create do |user|

SELECT  1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "lorenzoproietti16@outlook.it"], ["LIMIT", 1]]
---
  def self.new_with_session(params, session)
    super.tap do |user|
      if data = session["devise.facebook_data"] && session["devise.facebook_data"]["extra"]["raw_info"]
        user.email = data["email"] if user.email.blank?